In [1]:
import pandas as pd
import numpy as np

In [2]:
db=pd.read_csv("database.csv", sep=";")

## Sociodemographic

In [3]:
#Gender

db['E1'].value_counts()

Un homme       117
Une femme       33
Non-binaire      4
Name: E1, dtype: int64

In [4]:
#Age 

db['E2'].value_counts()

De 26 à 35 ans    94
De 18 à 25 ans    40
De 36 à 50 ans    18
Plus de 50 ans     2
Name: E2, dtype: int64

In [5]:
#Diplome 

db['E3'].value_counts()

Diplôme du second ou troisième cycle (licence, master)    89
Bac général, Bac Professionnel, Bac Technologique         32
BTS, BUT, DEUG                                            17
Sans diplôme                                              10
CAP, BEP                                                   6
Name: E3, dtype: int64

In [6]:
db['E4'].fillna('Non précisé', inplace=True)

In [7]:
db['E4'].value_counts()

Autre                                                             34
Ingénierie et Informatique                                        25
Arts, Lettres, Langues                                            22
Sciences humaines et sociales                                     21
Non précisé                                                       15
Commerce                                                          13
Sciences de la Vie et de la Terre : Biologie, Chimie, Physique    11
Droit, Économie, Gestion                                           9
Hôtellerie et Restauration                                         2
Santé                                                              2
Name: E4, dtype: int64

In [8]:
db.loc[(db['E3']=='Sans diplôme') & (db['E4']=='Autre'), 'E4'] = 'Non précisé'
db.loc[(db['E3']=='Sans diplôme') & (db['E4']=='Commerce'), 'E4'] = 'Non précisé'

In [9]:
pd.crosstab(db['E4'], db['E3'], margins=True)

E3,"BTS, BUT, DEUG","Bac général, Bac Professionnel, Bac Technologique","CAP, BEP","Diplôme du second ou troisième cycle (licence, master)",Sans diplôme,All
E4,,,,,,
"Arts, Lettres, Langues",1,6,1,14,0,22
Autre,5,6,3,19,0,33
Commerce,2,2,0,8,0,12
"Droit, Économie, Gestion",1,3,0,5,0,9
Hôtellerie et Restauration,0,0,2,0,0,2
Ingénierie et Informatique,4,5,0,16,0,25
Non précisé,1,5,0,1,10,17
Santé,0,1,0,1,0,2
"Sciences de la Vie et de la Terre : Biologie, Chimie, Physique",0,1,0,10,0,11
Sciences humaines et sociales,3,3,0,15,0,21
All,17,32,6,89,10,154

In [10]:
#CSP

db['E5'].value_counts()

Artisan, commerçant et chef d'entreprise         42
Employé·e                                        32
Sans emploi                                      30
Cadre et profession intellectuelle supérieure    26
Étudiant·e                                       16
Profession intermédiaire                          7
Agriculteur exploitant                            1
Name: E5, dtype: int64

In [11]:
pd.crosstab(db['E5'], db['E1'], margins=True)

E1,Non-binaire,Un homme,Une femme,All
E5,,,,
Agriculteur exploitant,1,0,0,1
"Artisan, commerçant et chef d'entreprise",2,28,12,42
Cadre et profession intellectuelle supérieure,0,20,6,26
Employé·e,1,24,7,32
Profession intermédiaire,0,5,2,7
Sans emploi,0,25,5,30
Étudiant·e,0,15,1,16
All,4,117,33,154

## Platform presence

In [12]:
#Production on specific platform
db = db.rename(columns={'A2[A21]': 'prod_fb', 
                        'A2[A22]': 'prod_insta',
                       'A2[A23]': 'prod_tk', 
                        'A2[A24]': 'prod_tw', 
                       'A2[A25]': 'prod_yt', 
                        'A2[other]': 'prod_other'})

In [13]:
#Platform distribution
df_plat_fb=db.groupby(['prod_fb']).size().reset_index(name='counts')
df_plat_fb=df_plat_fb.rename(columns={'prod_fb':'platform'})
df_plat_fb=df_plat_fb.replace({'Oui': 'Facebook', 'Non':'N/A'})

df_plat_insta=db.groupby(['prod_insta']).size().reset_index(name='counts')
df_plat_insta=df_plat_insta.rename(columns={'prod_insta':'platform'})
df_plat_insta=df_plat_insta.replace({'Oui': 'Instagram', 'Non':'N/A'})

df_plat_tk=db.groupby(['prod_tk']).size().reset_index(name='counts')
df_plat_tk=df_plat_tk.rename(columns={'prod_tk':'platform'})
df_plat_tk=df_plat_tk.replace({'Oui': 'TikTok', 'Non':'N/A'})    


df_plat_tw=db.groupby(['prod_tw']).size().reset_index(name='counts')
df_plat_tw=df_plat_tw.rename(columns={'prod_tw':'platform'})
df_plat_tw=df_plat_tw.replace({'Oui': 'Twitch', 'Non':'N/A'})

df_plat_yt=db.groupby(['prod_yt']).size().reset_index(name='counts')
df_plat_yt=df_plat_yt.rename(columns={'prod_yt':'platform'})
df_plat_yt=df_plat_yt.replace({'Oui': 'Youtube', 'Non':'N/A'})


df_plat=pd.concat([df_plat_fb.query('platform == "Facebook"'), df_plat_insta.query('platform == "Instagram"'), df_plat_tk.query('platform == "TikTok"'), df_plat_tw.query('platform == "Twitch"'), df_plat_yt.query('platform == "Youtube"')], ignore_index=True)

In [14]:
#Follow per platforms
db = db.rename(columns={'A4[A21]': 'follow_fb', 
                        'A4[A22]': 'follow_insta',
                       'A4[A23]': 'follow_tk', 
                        'A4[A24]': 'follow_tw', 
                       'A4[A25]': 'follow_yt'})

In [15]:
df_plat_fb=db.groupby(['prod_fb', 'follow_fb']).size().reset_index(name='counts')
df_plat_fb=df_plat_fb.rename(columns={'prod_fb':'platform', 'follow_fb':'count'})
df_plat_fb=df_plat_fb.replace({'Oui': 'Facebook', 'Non':'N/A'})
df_plat_fb

   platform                               count  counts
0  Facebook    Entre 1 000 et 10 000 personnes.       6
1  Facebook  Entre 10 000 et 100 000 personnes.       1
2  Facebook          Plus de 100 000 personnes.       1

In [16]:
df_plat_insta=db.groupby(['prod_insta', 'follow_insta']).size().reset_index(name='counts')
df_plat_insta=df_plat_insta.rename(columns={'prod_insta':'platform', 'follow_insta':'count'})
df_plat_insta=df_plat_insta.replace({'Oui': 'Instagram', 'Non':'N/A'})
df_plat_insta

    platform                               count  counts
0  Instagram    Entre 1 000 et 10 000 personnes.      12
1  Instagram  Entre 10 000 et 100 000 personnes.      19
2  Instagram           Moins de 1 000 personnes.      13
3  Instagram          Plus de 100 000 personnes.       4

In [17]:
df_plat_tk=db.groupby(['prod_tk', 'follow_tk']).size().reset_index(name='counts')
df_plat_tk=df_plat_tk.rename(columns={'prod_tk':'platform', 'follow_tk':'count'})
df_plat_tk=df_plat_tk.replace({'Oui': 'TikTok', 'Non':'N/A'})
df_plat_tk

  platform                               count  counts
0   TikTok    Entre 1 000 et 10 000 personnes.      13
1   TikTok  Entre 10 000 et 100 000 personnes.      12
2   TikTok           Moins de 1 000 personnes.      17
3   TikTok          Plus de 100 000 personnes.      11

In [18]:
df_plat_tw=db.groupby(['prod_tw', 'follow_tw']).size().reset_index(name='counts')
df_plat_tw=df_plat_tw.rename(columns={'prod_tw':'platform', 'follow_tw':'count'})
df_plat_tw=df_plat_tw.replace({'Oui': 'Twitch', 'Non':'N/A'})
df_plat_tw

  platform                               count  counts
0   Twitch    Entre 1 000 et 10 000 personnes.      32
1   Twitch  Entre 10 000 et 100 000 personnes.      28
2   Twitch           Moins de 1 000 personnes.      31
3   Twitch          Plus de 100 000 personnes.       3

In [19]:
df_plat_yt=db.groupby(['prod_yt', 'follow_yt']).size().reset_index(name='counts')
df_plat_yt=df_plat_yt.rename(columns={'prod_yt':'platform', 'follow_yt':'count'})
df_plat_yt=df_plat_yt.replace({'Oui': 'Youtube', 'Non':'N/A'})
df_plat_yt

  platform                               count  counts
0  Youtube    Entre 1 000 et 10 000 personnes.      25
1  Youtube  Entre 10 000 et 100 000 personnes.      33
2  Youtube           Moins de 1 000 personnes.      31
3  Youtube          Plus de 100 000 personnes.      37

In [20]:
df_plat=pd.concat([df_plat_fb, df_plat_insta, df_plat_tk, df_plat_tw, df_plat_yt])
df_plat

    platform                               count  counts
0   Facebook    Entre 1 000 et 10 000 personnes.       6
1   Facebook  Entre 10 000 et 100 000 personnes.       1
2   Facebook          Plus de 100 000 personnes.       1
0  Instagram    Entre 1 000 et 10 000 personnes.      12
1  Instagram  Entre 10 000 et 100 000 personnes.      19
2  Instagram           Moins de 1 000 personnes.      13
3  Instagram          Plus de 100 000 personnes.       4
0     TikTok    Entre 1 000 et 10 000 personnes.      13
1     TikTok  Entre 10 000 et 100 000 personnes.      12
2     TikTok           Moins de 1 000 personnes.      17
3     TikTok          Plus de 100 000 personnes.      11
0     Twitch    Entre 1 000 et 10 000 personnes.      32
1     Twitch  Entre 10 000 et 100 000 personnes.      28
2     Twitch           Moins de 1 000 personnes.      31
3     Twitch          Plus de 100 000 personnes.       3
0    Youtube    Entre 1 000 et 10 000 personnes.      25
1    Youtube  Entre 10 000 et 100 000 personnes.      33
2    Youtube           Moins de 1 000 personnes.      31
3    Youtube          Plus de 100 000 personnes.      37

### Multihoming

In [21]:
#Multihoming

db['dummy_fb']=np.where(db['prod_fb']=='Oui',1,0)

db['dummy_insta']=np.where(db['prod_insta']=='Oui',1,0)

db['dummy_tk']=np.where(db['prod_tk']=='Oui',1,0)

db['dummy_tw']=np.where(db['prod_tw']=='Oui',1,0)

db['dummy_yt']=np.where(db['prod_yt']=='Oui',1,0)

db['nb_plat_prod']=db['dummy_fb']+db['dummy_insta']+db['dummy_tk']+db['dummy_tw']+db['dummy_yt']


condition_mh=[(db['nb_plat_prod']==1),
             (db['nb_plat_prod']>1)]
values_mh=['False', 'True']
db['MH']=np.select(condition_mh, values_mh)
db['MH'].value_counts()

True     96
False    58
Name: MH, dtype: int64

In [22]:
db['nb_plat_prod'].mean()

2.1363636363636362

In [23]:
db['nb_plat_prod'].value_counts()

1    58
3    39
2    38
4    17
5     2
Name: nb_plat_prod, dtype: int64

### Aide à la production et gestion de contenu

In [24]:
#Aide à la production de contenus
condition_aide_prod=[(db['B4[B41]']=='Oui, aide bénévole.')  | (db['B4[B42]']=='Oui, aide bénévole.') | (db['B4[B43]']=='Oui, aide bénévole.')| (db['B4[B44]']=='Oui, aide bénévole.') |(db['B4[B41]']=='Oui, aide rémunérée.')  | (db['B4[B42]']=='Oui, aide rémunérée.') | (db['B4[B43]']=='Oui, aide rémunérée.')| (db['B4[B44]']=='Oui, aide rémunérée.')]
values_aide_prod=['oui']
db['aide_prod']=np.select(condition_aide_prod, values_aide_prod)
db['aide_prod']=db['aide_prod'].replace('0', 'non')

pd.crosstab(db['aide_prod'], db['A6'], margins=True)

A6         Facebook  Instagram  TikTok  Twitch  Youtube  All
aide_prod
non               1          2       2      20       58   83
oui               2          0       0      38       31   71
All               3          2       2      58       89  154

In [25]:
#Aide à la gestion des contenus et communautés
conditions_aide_manag=[(db['B6[B61]']=='Oui, aide bénévole.')  | (db['B6[B62]']=='Oui, aide bénévole.') | (db['B6[B63]']=='Oui, aide bénévole.')|(db['B6[B61]']=='Oui, aide rémunérée.')  | (db['B6[B62]']=='Oui, aide rémunérée.') | (db['B6[B63]']=='Oui, aide rémunérée.')]
values_aide_manag=['oui']
db['aide_manag']=np.select(conditions_aide_manag, values_aide_manag)
db['aide_manag']=db['aide_manag'].replace('0', 'non')

pd.crosstab(db['aide_manag'], db['A6'], margins=True)

A6          Facebook  Instagram  TikTok  Twitch  Youtube  All
aide_manag
non                2          2       2      22       66   94
oui                1          0       0      36       23   60
All                3          2       2      58       89  154

### Durée de l'activité audiovisuelle

In [26]:
#Time since they started per platforms
db = db.rename(columns={'A3[A21]': 'start_fb', 
                        'A3[A22]': 'start_insta',
                       'A3[A23]': 'start_tk', 
                        'A3[A24]': 'start_tw', 
                       'A3[A25]': 'start_yt'})

## Main Platform

In [27]:
#Main platform
db['A6'].value_counts()

Youtube      89
Twitch       58
Facebook      3
Instagram     2
TikTok        2
Name: A6, dtype: int64

### Facebook

In [28]:
#Facebook following

db_fb=db[db['A6']=='Facebook']
db_fb['follow_fb'].value_counts()

Entre 1 000 et 10 000 personnes.    2
Plus de 100 000 personnes.          1
Name: follow_fb, dtype: int64

In [29]:
db_fb['start_fb'].value_counts()

Entre deux et quatres ans    2
Depuis cinq ans et plus.     1
Name: start_fb, dtype: int64

In [30]:
pd.crosstab(db_fb['E11'], db_fb['start_fb'], margins=True)

start_fb,Depuis cinq ans et plus.,Entre deux et quatres ans,All
E11,,,
Entre 15 000€ et 30 000€,0,1,1
Moins de 15 000€,1,1,2
All,1,2,3

In [31]:
pd.crosstab(db_fb['B15'], db_fb['start_fb'], margins=True)

start_fb      Depuis cinq ans et plus.  Entre deux et quatres ans  All
B15
Moins de 10%                         1                          2    3
All                                  1                          2    3

In [32]:
pd.crosstab(db_fb['B2'], db_fb['follow_fb'], margins=True)

follow_fb,Entre 1 000 et 10 000 personnes.,Plus de 100 000 personnes.,All
B2,,,
Plus rarement,1,0,1
Plusieurs fois par semaine,1,0,1
Tous les jours,0,1,1
All,2,1,3

In [33]:
pd.crosstab(db_fb['B2'], db_fb['aide_prod'], margins=True)

aide_prod                   non  oui  All
B2
Plus rarement                 0    1    1
Plusieurs fois par semaine    0    1    1
Tous les jours                1    0    1
All                           1    2    3

In [34]:
pd.crosstab(db_fb['B2'], db_fb['aide_manag'], margins=True)

aide_manag                  non  oui  All
B2
Plus rarement                 1    0    1
Plusieurs fois par semaine    0    1    1
Tous les jours                1    0    1
All                           2    1    3

### Instagram

In [35]:
#Instagram following

db_insta=db[db['A6']=='Instagram']
db_insta['follow_insta'].value_counts()

Entre 1 000 et 10 000 personnes.    1
Moins de 1 000 personnes.           1
Name: follow_insta, dtype: int64

In [36]:
db_insta['start_insta'].value_counts()

Depuis cinq ans et plus.    1
Depuis moins d'un an.       1
Name: start_insta, dtype: int64

In [37]:
pd.crosstab(db_insta['E11'], db_insta['start_insta'], margins=True)

start_insta       Depuis cinq ans et plus.  Depuis moins d'un an.  All
E11
Moins de 15 000€                         1                      1    2
All                                      1                      1    2

In [38]:
pd.crosstab(db_insta['B15'], db_insta['start_insta'], margins=True)

start_insta   Depuis cinq ans et plus.  Depuis moins d'un an.  All
B15
Moins de 10%                         1                      1    2
All                                  1                      1    2

In [39]:
pd.crosstab(db_insta['B2'], db_insta['follow_insta'], margins=True)

follow_insta,Entre 1 000 et 10 000 personnes.,Moins de 1 000 personnes.,All
B2,,,
Plusieurs fois par mois,1,1,2
All,1,1,2

In [40]:
pd.crosstab(db_insta['B2'], db_insta['aide_prod'], margins=True)

aide_prod                non  All
B2
Plusieurs fois par mois    2    2
All                        2    2

In [41]:
pd.crosstab(db_insta['B2'], db_insta['aide_manag'], margins=True)

aide_manag               non  All
B2
Plusieurs fois par mois    2    2
All                        2    2

### TikTok

In [42]:
#TikTok following

db_tk=db[db['A6']=='TikTok']
db_tk['follow_tk'].value_counts()

Entre 1 000 et 10 000 personnes.      1
Entre 10 000 et 100 000 personnes.    1
Name: follow_tk, dtype: int64

In [43]:
db_tk['start_tk'].value_counts()

Entre un et deux ans.    1
Depuis moins d'un an.    1
Name: start_tk, dtype: int64

In [44]:
pd.crosstab(db_tk['E11'], db_tk['start_tk'], margins=True)

start_tk                  Depuis moins d'un an.  Entre un et deux ans.  All
E11
Entre 15 000€ et 30 000€                      1                      0    1
Moins de 15 000€                              0                      1    1
All                                           1                      1    2

In [45]:
pd.crosstab(db_tk['B15'], db_tk['start_tk'], margins=True)

start_tk      Depuis moins d'un an.  Entre un et deux ans.  All
B15
Moins de 10%                      1                      1    2
All                               1                      1    2

In [46]:
pd.crosstab(db_tk['B2'], db_tk['follow_tk'], margins=True)

follow_tk,Entre 1 000 et 10 000 personnes.,Entre 10 000 et 100 000 personnes.,All
B2,,,
Plusieurs fois par semaine,0,1,1
Tous les jours,1,0,1
All,1,1,2

In [47]:
pd.crosstab(db_tk['B2'], db_tk['aide_prod'], margins=True)

aide_prod                   non  All
B2
Plusieurs fois par semaine    1    1
Tous les jours                1    1
All                           2    2

In [48]:
pd.crosstab(db_tk['B2'], db_tk['aide_manag'], margins=True)

aide_manag                  non  All
B2
Plusieurs fois par semaine    1    1
Tous les jours                1    1
All                           2    2

### Twitch

In [49]:
#Twitch following

db_tw=db[db['A6']=='Twitch']
db_tw['follow_tw'].value_counts()

Entre 1 000 et 10 000 personnes.      21
Moins de 1 000 personnes.             19
Entre 10 000 et 100 000 personnes.    16
Plus de 100 000 personnes.             2
Name: follow_tw, dtype: int64

In [50]:
db_tw['start_tw'].value_counts()

Entre un et deux ans.        25
Entre deux et quatres ans    18
Depuis cinq ans et plus.     11
Depuis moins d'un an.         4
Name: start_tw, dtype: int64

In [51]:
pd.crosstab(db_tw['E11'], db_tw['start_tw'], margins=True)

start_tw,Depuis cinq ans et plus.,Depuis moins d'un an.,Entre deux et quatres ans,Entre un et deux ans.,All
E11,,,,,
Entre 15 000€ et 30 000€,2,0,10,7,19
Moins de 15 000€,3,4,7,13,27
Plus de 30 000€,6,0,1,5,12
All,11,4,18,25,58

In [52]:
pd.crosstab(db_tw['B15'], db_tw['start_tw'], margins=True)

start_tw,Depuis cinq ans et plus.,Depuis moins d'un an.,Entre deux et quatres ans,Entre un et deux ans.,All
B15,,,,,
Entre 11% et 50%,2,1,2,4,9
Moins de 10%,3,3,10,16,32
Plus de 50%,6,0,6,5,17
All,11,4,18,25,58

In [53]:
pd.crosstab(db_tw['B2'], db_tw['follow_tw'], margins=True)

follow_tw,Entre 1 000 et 10 000 personnes.,Entre 10 000 et 100 000 personnes.,Moins de 1 000 personnes.,Plus de 100 000 personnes.,All
B2,,,,,
Plus rarement,1,0,2,0,3
Plusieurs fois par mois,2,0,3,0,5
Plusieurs fois par semaine,18,7,13,0,38
Tous les jours,0,9,1,2,12
All,21,16,19,2,58

In [54]:
pd.crosstab(db_tw['B2'], db_tw['aide_prod'], margins=True)

aide_prod                   non  oui  All
B2
Plus rarement                 3    0    3
Plusieurs fois par mois       4    1    5
Plusieurs fois par semaine   12   26   38
Tous les jours                1   11   12
All                          20   38   58

In [55]:
pd.crosstab(db_tw['B2'], db_tw['aide_manag'], margins=True)

aide_manag                  non  oui  All
B2
Plus rarement                 2    1    3
Plusieurs fois par mois       3    2    5
Plusieurs fois par semaine   15   23   38
Tous les jours                2   10   12
All                          22   36   58

### Youtube

In [56]:
#Youtube following

db_yt=db[db['A6']=='Youtube']
db_yt['follow_yt'].value_counts()

Plus de 100 000 personnes.            33
Entre 10 000 et 100 000 personnes.    27
Moins de 1 000 personnes.             15
Entre 1 000 et 10 000 personnes.      14
Name: follow_yt, dtype: int64

In [57]:
db_yt['start_yt'].value_counts()

Depuis cinq ans et plus.     48
Entre deux et quatres ans    22
Entre un et deux ans.        12
Depuis moins d'un an.         7
Name: start_yt, dtype: int64

In [58]:
pd.crosstab(db_yt['E11'], db_yt['start_yt'], margins=True)

start_yt,Depuis cinq ans et plus.,Depuis moins d'un an.,Entre deux et quatres ans,Entre un et deux ans.,All
E11,,,,,
Entre 15 000€ et 30 000€,18,1,6,2,27
Moins de 15 000€,17,5,12,6,40
Plus de 30 000€,13,1,4,4,22
All,48,7,22,12,89

In [59]:
pd.crosstab(db_yt['B15'], db_yt['start_yt'], margins=True)

start_yt,Depuis cinq ans et plus.,Depuis moins d'un an.,Entre deux et quatres ans,Entre un et deux ans.,All
B15,,,,,
Entre 11% et 50%,8,0,3,1,12
Moins de 10%,15,6,12,6,39
Plus de 50%,25,1,7,5,38
All,48,7,22,12,89

In [60]:
pd.crosstab(db_yt['B2'], db_yt['follow_yt'], margins=True)

follow_yt,Entre 1 000 et 10 000 personnes.,Entre 10 000 et 100 000 personnes.,Moins de 1 000 personnes.,Plus de 100 000 personnes.,All
B2,,,,,
Plus rarement,8,9,7,6,30
Plusieurs fois par mois,5,9,5,18,37
Plusieurs fois par semaine,1,7,3,4,15
Tous les jours,0,2,0,5,7
All,14,27,15,33,89

In [61]:
pd.crosstab(db_yt['B2'], db_yt['aide_prod'], margins=True)

aide_prod                   non  oui  All
B2
Plus rarement                21    9   30
Plusieurs fois par mois      22   15   37
Plusieurs fois par semaine    8    7   15
Tous les jours                7    0    7
All                          58   31   89

In [62]:
pd.crosstab(db_yt['B2'], db_yt['aide_manag'], margins=True)

aide_manag                  non  oui  All
B2
Plus rarement                26    4   30
Plusieurs fois par mois      26   11   37
Plusieurs fois par semaine    9    6   15
Tous les jours                5    2    7
All                          66   23   89

### Fréquence de publication

In [63]:
#Fréquence de publication
pd.crosstab(db['B2'], db['A6'], margins=True)

A6                          Facebook  Instagram  TikTok  Twitch  Youtube  All
B2
Plus rarement                      1          0       0       3       30   34
Plusieurs fois par mois            0          2       0       5       37   44
Plusieurs fois par semaine         1          0       1      38       15   55
Tous les jours                     1          0       1      12        7   21
All                                3          2       2      58       89  154

In [64]:
pd.crosstab(db['aide_prod'], db['B2'], margins=True)

B2,Plus rarement,Plusieurs fois par mois,Plusieurs fois par semaine,Tous les jours,All
aide_prod,,,,,
non,24,28,21,10,83
oui,10,16,34,11,71
All,34,44,55,21,154

In [65]:
pd.crosstab(db['aide_manag'], db['B2'], margins=True)

B2,Plus rarement,Plusieurs fois par mois,Plusieurs fois par semaine,Tous les jours,All
aide_manag,,,,,
non,29,31,25,9,94
oui,5,13,30,12,60
All,34,44,55,21,154

### Multihoming

In [66]:
pd.crosstab(db['aide_prod'], db['MH'], margins=True)

MH         False  True  All
aide_prod
non           40    43   83
oui           18    53   71
All           58    96  154

In [67]:
pd.crosstab(db['aide_manag'], db['MH'], margins=True)

MH          False  True  All
aide_manag
non            46    48   94
oui            12    48   60
All            58    96  154

In [68]:
pd.crosstab(db['MH'], db['A6'], margins=True)

A6     Facebook  Instagram  TikTok  Twitch  Youtube  All
MH
False         0          0       1      25       32   58
True          3          2       1      33       57   96
All           3          2       2      58       89  154

### Format

In [69]:
condition_forma=[(db['B1[SQ001]']=='Oui') & (db['B1[SQ002]']=='Non'), 
                (db['B1[SQ001]']=='Non') & (db['B1[SQ002]']=='Oui'),
                (db['B1[SQ001]']=='Oui') & (db['B1[SQ002]']=='Oui')]
values_forma=['VOD_uniquement', 'Live_uniquement', 'VOD_Live']
db['format']=np.select(condition_forma, values_forma)

In [70]:
pd.crosstab(db['B2'], db['format'], margins=True)

format                      Live_uniquement  VOD_Live  VOD_uniquement  All
B2
Plus rarement                             3         0              31   34
Plusieurs fois par mois                   5         2              37   44
Plusieurs fois par semaine               39         3              13   55
Tous les jours                           10         5               6   21
All                                      57        10              87  154

In [71]:
pd.crosstab(db['MH'], db['format'], margins=True)

format  Live_uniquement  VOD_Live  VOD_uniquement  All
MH
False                24         4              30   58
True                 33         6              57   96
All                  57        10              87  154

### Sources de revenus

In [72]:
#Les types de revenus
db = db.rename(columns={'B13[RB131]':'rev_pub', 
                       'B13[RB132]':'rev_abo', 
                       'B13[RB133]':'rev_sponso', 
                       'B13[RB134]':'rev_don_plat', 
                       'B13[RB135]':'rev_don_ext_plat', 
                       'B13[RB136]':'rev_prod_derives',
                       'B13[other]':'rev_other'})

db['rev_sponso'].fillna('Non', inplace=True)

In [73]:
db['rev_pub'].value_counts()

Oui    81
Non    73
Name: rev_pub, dtype: int64

In [74]:
pd.crosstab(db['rev_pub'], db['B2'], margins=True)

B2,Plus rarement,Plusieurs fois par mois,Plusieurs fois par semaine,Tous les jours,All
rev_pub,,,,,
Non,23,18,24,8,73
Oui,11,26,31,13,81
All,34,44,55,21,154

In [75]:
pd.crosstab(db['rev_pub'], db['format'], margins=True)

format   Live_uniquement  VOD_Live  VOD_uniquement  All
rev_pub
Non                   26         4              43   73
Oui                   31         6              44   81
All                   57        10              87  154

In [76]:
db['rev_abo'].value_counts()

Non    88
Oui    66
Name: rev_abo, dtype: int64

In [77]:
pd.crosstab(db['rev_abo'], db['B2'], margins=True)

B2,Plus rarement,Plusieurs fois par mois,Plusieurs fois par semaine,Tous les jours,All
rev_abo,,,,,
Non,32,33,18,5,88
Oui,2,11,37,16,66
All,34,44,55,21,154

In [78]:
pd.crosstab(db['rev_abo'], db['format'], margins=True)

format   Live_uniquement  VOD_Live  VOD_uniquement  All
rev_abo
Non                    7         4              77   88
Oui                   50         6              10   66
All                   57        10              87  154

In [79]:
db['rev_sponso'].value_counts()

Non    101
Oui     53
Name: rev_sponso, dtype: int64

In [80]:
pd.crosstab(db['rev_sponso'], db['B2'], margins=True)

B2,Plus rarement,Plusieurs fois par mois,Plusieurs fois par semaine,Tous les jours,All
rev_sponso,,,,,
Non,27,23,41,10,101
Oui,7,21,14,11,53
All,34,44,55,21,154

In [81]:
pd.crosstab(db['rev_sponso'], db['format'], margins=True)

format      Live_uniquement  VOD_Live  VOD_uniquement  All
rev_sponso
Non                      40         4              57  101
Oui                      17         6              30   53
All                      57        10              87  154

In [82]:
db['rev_don_plat'].value_counts()

Non    110
Oui     44
Name: rev_don_plat, dtype: int64

In [83]:
pd.crosstab(db['rev_don_plat'], db['B2'], margins=True)

B2,Plus rarement,Plusieurs fois par mois,Plusieurs fois par semaine,Tous les jours,All
rev_don_plat,,,,,
Non,33,37,31,9,110
Oui,1,7,24,12,44
All,34,44,55,21,154

In [84]:
pd.crosstab(db['rev_don_plat'], db['format'], margins=True)

format        Live_uniquement  VOD_Live  VOD_uniquement  All
rev_don_plat
Non                        29         3              78  110
Oui                        28         7               9   44
All                        57        10              87  154

In [85]:
db['rev_don_ext_plat'].value_counts()

Non    104
Oui     50
Name: rev_don_ext_plat, dtype: int64

In [86]:
pd.crosstab(db['rev_don_ext_plat'], db['B2'], margins=True)

B2,Plus rarement,Plusieurs fois par mois,Plusieurs fois par semaine,Tous les jours,All
rev_don_ext_plat,,,,,
Non,20,33,34,17,104
Oui,14,11,21,4,50
All,34,44,55,21,154

In [87]:
pd.crosstab(db['rev_don_ext_plat'], db['format'], margins=True)

format            Live_uniquement  VOD_Live  VOD_uniquement  All
rev_don_ext_plat
Non                            40         5              59  104
Oui                            17         5              28   50
All                            57        10              87  154

In [88]:
db['rev_prod_derives'].value_counts()

Non    130
Oui     24
Name: rev_prod_derives, dtype: int64

In [89]:
pd.crosstab(db['rev_prod_derives'], db['B2'], margins=True)

B2,Plus rarement,Plusieurs fois par mois,Plusieurs fois par semaine,Tous les jours,All
rev_prod_derives,,,,,
Non,30,33,46,21,130
Oui,4,11,9,0,24
All,34,44,55,21,154

In [90]:
pd.crosstab(db['rev_prod_derives'], db['format'], margins=True)

format            Live_uniquement  VOD_Live  VOD_uniquement  All
rev_prod_derives
Non                            52         7              71  130
Oui                             5         3              16   24
All                            57        10              87  154

In [91]:
db['rev_other'].value_counts()

CNC talent                                                                                                                                                                                      1
CNC                                                                                                                                                                                             1
Production de plateaux en marque blanche                                                                                                                                                        1
Bourse de création externe (Université)                                                                                                                                                         1
Payée au noir pour la co-écriture de vidéos  sur une chaîne YT autre que la mienne, et pour laquelle la vidéaste principale est rémunérée par facture (chaîne YT appartenant à un organisme)    1
boutique                                                                                                                                                                                        1
Prestations ponctuelles                                                                                                                                                                         1
Subvention publique                                                                                                                                                                             1
Revenus Youtube                                                                                                                                                                                 1
Droits d'auteur issus de la diffusion de contenus sur la plateforme.                                                                                                                            1
cdi                                                                                                                                                                                             1
Vente direct à des médias                                                                                                                                                                       1
Showcase,concert                                                                                                                                                                                1
Name: rev_other, dtype: int64

In [92]:
pd.crosstab(db['rev_other'], db['B2'], margins=True)

B2,Plus rarement,Plusieurs fois par mois,Plusieurs fois par semaine,Tous les jours,All
rev_other,,,,,
Bourse de création externe (Université),1,0,0,0,1
CNC,1,0,0,0,1
CNC talent,1,0,0,0,1
Droits d'auteur issus de la diffusion de contenus sur la plateforme.,0,1,0,0,1
"Payée au noir pour la co-écriture de vidéos sur une chaîne YT autre que la mienne, et pour laquelle la vidéaste principale est rémunérée par facture (chaîne YT appartenant à un organisme)",1,0,0,0,1
Prestations ponctuelles,0,1,0,0,1
Production de plateaux en marque blanche,0,0,1,0,1
Revenus Youtube,0,0,0,1,1
"Showcase,concert",0,1,0,0,1
Subvention publique,0,1,0,0,1
Vente direct à des médias,0,0,0,1,1
boutique,0,0,1,0,1
cdi,0,0,0,1,1
All,4,4,2,3,13

In [93]:
pd.crosstab(db['rev_other'], db['format'], margins=True)

format,Live_uniquement,VOD_Live,VOD_uniquement,All
rev_other,,,,
Bourse de création externe (Université),0,0,1,1
CNC,0,0,1,1
CNC talent,0,0,1,1
Droits d'auteur issus de la diffusion de contenus sur la plateforme.,0,0,1,1
"Payée au noir pour la co-écriture de vidéos sur une chaîne YT autre que la mienne, et pour laquelle la vidéaste principale est rémunérée par facture (chaîne YT appartenant à un organisme)",0,0,1,1
Prestations ponctuelles,0,0,1,1
Production de plateaux en marque blanche,1,0,0,1
Revenus Youtube,1,0,0,1
"Showcase,concert",0,0,1,1
Subvention publique,0,0,1,1
Vente direct à des médias,0,0,1,1
boutique,0,1,0,1
cdi,1,0,0,1
All,3,1,9,13

In [94]:
db['B13[RB137]'].value_counts()

Non    119
Oui     35
Name: B13[RB137], dtype: int64

In [95]:
pd.crosstab(db['B13[RB137]'], db['B2'], margins=True)

B2,Plus rarement,Plusieurs fois par mois,Plusieurs fois par semaine,Tous les jours,All
B13[RB137],,,,,
Non,20,36,45,18,119
Oui,14,8,10,3,35
All,34,44,55,21,154

In [96]:
pd.crosstab(db['B13[RB137]'], db['format'], margins=True)

format      Live_uniquement  VOD_Live  VOD_uniquement  All
B13[RB137]
Non                      51         8              60  119
Oui                       6         2              27   35
All                      57        10              87  154

In [97]:
# Codifier la source principale de revenus


condition_rev_prin=[(db['B14[RB131]']=='Oui'), 
                   (db['B14[RB132]']=='Oui'), 
                   (db['B14[RB133]']=='Oui'), 
                   (db['B14[RB134]']=='Oui'), 
                   (db['B14[RB135]']=='Oui'), 
                   (db['B14[RB136]']=='Oui'), 
                   (db['B14[RB137]']=='Oui'),
                   (db['B14[other]'] is not None)]

value_rev_prin=['pub', 'abo', 'sponso', 'don_plat', 'don_ext', 'prod_deriv', 'none', 'other']

db['rev_prin']=np.select(condition_rev_prin, value_rev_prin)

In [98]:
db['rev_prin'].value_counts()

abo           45
none          35
pub           27
sponso        17
don_ext       17
other          8
prod_deriv     4
don_plat       1
Name: rev_prin, dtype: int64

In [99]:
pd.crosstab(db['rev_prin'], db['MH'], margins=True)

MH          False  True  All
rev_prin
abo            21    24   45
don_ext         6    11   17
don_plat        0     1    1
none           17    18   35
other           5     3    8
prod_deriv      0     4    4
pub             5    22   27
sponso          4    13   17
All            58    96  154

In [100]:
pd.crosstab(db['rev_prin'], db['B2'], margins=True)

B2,Plus rarement,Plusieurs fois par mois,Plusieurs fois par semaine,Tous les jours,All
rev_prin,,,,,
abo,1,5,29,10,45
don_ext,9,4,4,0,17
don_plat,0,1,0,0,1
none,14,8,10,3,35
other,4,1,1,2,8
prod_deriv,0,2,2,0,4
pub,2,13,7,5,27
sponso,4,10,2,1,17
All,34,44,55,21,154

In [101]:
pd.crosstab(db['rev_prin'], db['format'], margins=True)

format      Live_uniquement  VOD_Live  VOD_uniquement  All
rev_prin
abo                      42         3               0   45
don_ext                   2         0              15   17
don_plat                  0         0               1    1
none                      6         2              27   35
other                     2         0               6    8
prod_deriv                2         0               2    4
pub                       1         4              22   27
sponso                    2         1              14   17
All                      57        10              87  154

In [102]:
db['B15'].value_counts()

Moins de 10%        78
Plus de 50%         55
Entre 11% et 50%    21
Name: B15, dtype: int64

In [103]:
pd.crosstab(db['B15'], db['format'], margins=True)

format            Live_uniquement  VOD_Live  VOD_uniquement  All
B15
Entre 11% et 50%                8         3              10   21
Moins de 10%                   33         2              43   78
Plus de 50%                    16         5              34   55
All                            57        10              87  154

In [104]:
pd.crosstab(db['B15'], db['B2'], margins=True)

B2,Plus rarement,Plusieurs fois par mois,Plusieurs fois par semaine,Tous les jours,All
B15,,,,,
Entre 11% et 50%,2,8,7,4,21
Moins de 10%,24,20,30,4,78
Plus de 50%,8,16,18,13,55
All,34,44,55,21,154

In [105]:
pd.crosstab(db['B15'], db['E11'], margins=True)

E11,Entre 15 000€ et 30 000€,Moins de 15 000€,Plus de 30 000€,All
B15,,,,
Entre 11% et 50%,7,9,5,21
Moins de 10%,20,45,13,78
Plus de 50%,21,18,16,55
All,48,72,34,154

### Membre réseaux

In [106]:
db['B8[SQ001]'].value_counts()

Oui    102
Non     52
Name: B8[SQ001], dtype: int64

In [107]:
db['B8[SQ002]'].value_counts()

Non    142
Oui     12
Name: B8[SQ002], dtype: int64

In [108]:
db['B8[SQ004]'].value_counts()

Non    152
Oui      2
Name: B8[SQ004], dtype: int64